Revit 2027 API
AnalysisDisplayVectorSettings.VectorOrientation Property
 Vector orientation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleVectorOrientation VectorOrientation { get; set; }
Public Property VectorOrientation As AnalysisDisplayStyleVectorOrientation
	Get
	Set
public:
property AnalysisDisplayStyleVectorOrientation VectorOrientation {
	AnalysisDisplayStyleVectorOrientation get ();
	void set (AnalysisDisplayStyleVectorOrientation value);
}
member VectorOrientation : AnalysisDisplayStyleVectorOrientation with get, set
Property Value
AnalysisDisplayStyleVectorOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace